weycen/STM32Fxxx_StdPeriph_Templates_FileX/Libraries/filex-6.1.7/driver/stm32_spi_sd - 副本.c
// static uint32_t CardType = SD_STD_CAPACITY_SD_CARD_V1_1;
static uint32_t CardType = SD_HIGH_CAPACITY_SD_CARD;
/* Prototypes of private function --------------------------------------------*/

/* Definition of functions ---------------------------------------------------*/

/**
 * @brief  DeInitializes the SD/SD communication.
 * @param  None
 * @retval None
 */
void SD_DeInit(void) { SD_LowLevel_DeInit(); }

/**
 * @brief  Initializes the SD/SD communication.
 * @param  None
 * @retval The SD Response:
 *         - SD_RESPONSE_FAILURE: Sequence failed
 *         - SD_RESPONSE_NO_ERROR: Sequence succeed
 */
SD_Error SD_Init(void) {
  uint32_t i = 0;

  /*!< Initialize SD_SPI */
  SD_LowLevel_Init();

  /*!< SD chip select high */
  SD_CS_HIGH();

  /*!< Send dummy byte 0xFF, 10 times with CS high */
  /*!< Rise CS and MOSI for 80 clocks cycles */
  for (i = 0; i <= 9; i++) {
    /*!< Send dummy byte 0xFF */
    SD_WriteByte(SD_DUMMY_BYTE);
  }

  /*------------Put SD in SPI mode--------------*/
  /*!< SD initialized and set to SPI mode properly */
  return (SD_GoIdleState());
}

/**
 * @brief  Detect if SD card is correctly plugged in the memory slot.
 * @param  None
 * @retval Return if SD is detected or not
 */
uint8_t SD_Detect(void) {
  __IO uint8_t status = SD_PRESENT;

  /*!< Check GPIO to detect SD */
  if (GPIO_ReadInputData(SD_DETECT_GPIO_PORT) & SD_DETECT_PIN) {
    status = SD_NOT_PRESENT;
  }
  return status;
}

/**
 * @brief  Returns information about specific card.
 * @param  cardinfo: pointer to a SD_CardInfo structure that contains all SD
 *         card information.
 * @retval The SD Response:
 *         - SD_RESPONSE_FAILURE: Sequence failed
 *         - SD_RESPONSE_NO_ERROR: Sequence succeed
 */
SD_Error SD_GetCardInfo(SD_CardInfo* cardinfo) {
  SD_Error status = SD_RESPONSE_FAILURE;

  status                 = SD_GetCSDRegister(&(cardinfo->SD_csd));
  status                 = SD_GetCIDRegister(&(cardinfo->SD_cid));
  cardinfo->CardCapacity = (cardinfo->SD_csd.DeviceSize + 1);
  cardinfo->CardCapacity *= (1 << (cardinfo->SD_csd.DeviceSizeMul + 2));
  cardinfo->CardBlockSize = 1 << (cardinfo->SD_csd.RdBlockLen);
  cardinfo->CardCapacity *= cardinfo->CardBlockSize;

  /*!< Returns the reponse */
  return status;
}

/**
 * @brief  Reads block(s) from a specified address in the SD card, in polling mode.
 * @param  pBuffer: pointer to the buffer that receives the data read from the
 *                  SD.
 * @param  ReadAddr: SD's internal address to read from.
 * @param  BlockSize: the SD card Data block size.
 * @param  NumberOfBlocks: number of blocks to be read.
 * @retval The SD Response:
 *         - SD_RESPONSE_FAILURE: Sequence failed
 *         - SD_RESPONSE_NO_ERROR: Sequence succeed
 */
SD_Error SD_ReadBlocks(uint8_t* pBuffer, uint64_t ReadAddr, uint16_t BlockSize, uint32_t NumberOfBlocks) {
  uint32_t i = 0, Offset = 0;
  SD_Error rvalue      = SD_RESPONSE_FAILURE;
  uint32_t offset_unit = SD_BLOCK_SIZE;

  /*!< SD chip select low */
  SD_CS_LOW();

  /* Send CMD16 (SD_CMD_SET_BLOCKLEN) to set the size of the block and
     Check if the SD acknowledged the set block length command: R1 response (0x00: no errors) */
  SD_SendCmd(SD_CMD_SET_BLOCKLEN, SD_BLOCK_SIZE, 0xFF);
  SD_WriteByte(SD_DUMMY_BYTE);
  if (!SD_GetResponse(SD_RESPONSE_NO_ERROR)) {
    return SD_RESPONSE_FAILURE;
  }

  if (CardType == SD_HIGH_CAPACITY_SD_CARD) {
    ReadAddr >>= 9; /* Convert it to sector address, divided by 512 */
    offset_unit = 1;
  }

  /*!< Data transfer */
  while (NumberOfBlocks--) {
    /*!< Send CMD17 (SD_CMD_READ_SINGLE_BLOCK) to read one block and
      Check if the SD acknowledged the read block command: R1 response (0x00: no errors) */
    SD_SendCmd(SD_CMD_READ_SINGLE_BLOCK, ReadAddr, 0xFF);
    if (SD_GetResponse(SD_RESPONSE_NO_ERROR)) {
      return SD_RESPONSE_FAILURE;
    }

    /*!< Now look for the data token to signify the start of the data */
    if (!SD_GetResponse(SD_START_DATA_SINGLE_BLOCK_READ)) {
      /*!< Read the SD block data : read NumByteToRead data */
      for (i = 0; i < SD_BLOCK_SIZE; i++) {
        /*!< Read the pointed data */
        *pBuffer = SD_ReadByte();
        /*!< Point to the next location where the byte read will be saved */
        pBuffer++;
      }

      /*!< Set next read address*/
      Offset += offset_unit;

      /*!< get CRC bytes (not really needed by us, but required by SD) */
      SD_ReadByte();
      SD_ReadByte();

      /*!< Set response value to success */
      rvalue = SD_RESPONSE_NO_ERROR;
    } else {
      /*!< Set response value to failure */
      rvalue = SD_RESPONSE_FAILURE;
    }
  }

  /*!< SD chip select high */
  SD_CS_HIGH();

  /*!< Send dummy byte: 8 Clock pulses of delay */
  SD_WriteByte(SD_DUMMY_BYTE);

  /*!< Returns the reponse */
  return rvalue;
}

/**
 * @brief  Writes block(s) from a specified address in the SD card, in polling mode.
 * @param  pBuffer: pointer to the buffer containing the data to be written on
 *                  the SD.
 * @param  WriteAddr: address to write on.
 * @param  BlockSize: the SD card Data block size.
 * @param  NumberOfBlocks: number of blocks to be written.
 * @retval The SD Response:
 *         - SD_RESPONSE_FAILURE: Sequence failed
 *         - SD_RESPONSE_NO_ERROR: Sequence succeed
 */
SD_Error SD_WriteBlocks(uint8_t* pBuffer, uint32_t WriteAddr, uint16_t BlockSize, uint32_t NumberOfBlocks) {
  uint32_t i = 0, Offset = 0;
  SD_Error rvalue      = SD_RESPONSE_FAILURE;
  uint32_t offset_unit = SD_BLOCK_SIZE;

  /*!< SD chip select low */
  SD_CS_LOW();

  /* Send CMD16 (SD_CMD_SET_BLOCKLEN) to set the size of the block and
     Check if the SD acknowledged the set block length command: R1 response (0x00: no errors) */
  SD_SendCmd(SD_CMD_SET_BLOCKLEN, SD_BLOCK_SIZE, 0xFF);
  SD_WriteByte(SD_DUMMY_BYTE);
  if (!SD_GetResponse(SD_RESPONSE_NO_ERROR)) {
    return SD_RESPONSE_FAILURE;
  }

  if (CardType == SD_HIGH_CAPACITY_SD_CARD) {
    WriteAddr >>= 9; /* Convert it to sector address, divided by 512 */
    offset_unit = 1;
  }

  /*!< Data transfer */
  while (NumberOfBlocks--) {
    /*!< Send CMD24 (SD_CMD_WRITE_SINGLE_BLOCK) to write blocks and
         Check if the SD acknowledged the write block command: R1 response (0x00: no errors) */
    SD_SendCmd(SD_CMD_WRITE_SINGLE_BLOCK, WriteAddr, 0xFF);
    if (SD_GetResponse(SD_RESPONSE_NO_ERROR)) {
      return SD_RESPONSE_FAILURE;
    }

